{
  "appendixId": "A",
  "title": "Glossary of Terms",
  "content": {
    "terms": [
      {"term": "Accumulator", "definition": "A vessel containing hydraulic fluid under pressure used to operate BOP equipment."},
      {"term": "Annular Preventer", "definition": "A BOP component that uses a rubber element to seal around any size pipe, kelly, or open hole."},
      {"term": "Back Pressure", "definition": "Pressure maintained on the annulus during well control operations, typically applied through the choke."},
      {"term": "Balanced Plug", "definition": "A cement plug placed in the wellbore using the balanced plug method where tubing is raised as cement is placed."},
      {"term": "Barrier", "definition": "An envelope of one or more barrier elements that prevents flow from a source."},
      {"term": "Barrier Element", "definition": "A single component that cannot prevent flow by itself but contributes to a barrier."},
      {"term": "BHA", "definition": "Bottom Hole Assembly - the lower portion of the drillstring including bit, collars, and tools."},
      {"term": "BHP", "definition": "Bottom Hole Pressure - total pressure at a given depth in the well."},
      {"term": "Blind Rams", "definition": "BOP rams designed to close on open hole when no pipe is in the well."},
      {"term": "Blind Shear Rams", "definition": "BOP rams that can cut through drillpipe and seal the wellbore."},
      {"term": "Blowout", "definition": "Uncontrolled flow of formation fluids from the wellbore."},
      {"term": "BOP", "definition": "Blowout Preventer - pressure control equipment installed on the wellhead."},
      {"term": "Bullheading", "definition": "Forcing fluids down the wellbore against formation pressure without circulation."},
      {"term": "Casing", "definition": "Steel pipe cemented in the wellbore to provide structural integrity and isolation."},
      {"term": "Choke", "definition": "An adjustable valve used to control flow rate and back pressure during well control."},
      {"term": "Choke Line", "definition": "High-pressure line connecting the BOP stack to the choke manifold."},
      {"term": "Circulating Pressure", "definition": "Pressure required to circulate fluid through the well at a given rate."},
      {"term": "Connection Gas", "definition": "Gas that enters the wellbore during connections due to loss of ECD."},
      {"term": "Cuttings", "definition": "Rock fragments produced by the drill bit and circulated to surface."},
      {"term": "DGAS", "definition": "Drilling Gas - background gas level while drilling."},
      {"term": "Driller's Method", "definition": "Well kill method using two circulations: first to circulate kick out, second to circulate kill mud in."},
      {"term": "ECD", "definition": "Equivalent Circulating Density - effective mud weight including friction losses while circulating."},
      {"term": "EDS", "definition": "Emergency Disconnect System - system to disconnect from subsea BOP in emergency."},
      {"term": "EMW", "definition": "Equivalent Mud Weight - formation pressure expressed as equivalent density."},
      {"term": "Flow Check", "definition": "Stopping circulation to observe whether the well is flowing."},
      {"term": "FCP", "definition": "Final Circulating Pressure - pump pressure when kill mud reaches the bit."},
      {"term": "Formation Integrity Test", "definition": "Test to determine the maximum pressure a formation can withstand without fracturing."},
      {"term": "Gas Cut Mud", "definition": "Drilling fluid containing entrained gas, reducing density."},
      {"term": "Hard Shut-In", "definition": "Closing BOP with pumps off and no choke line flow."},
      {"term": "HPHT", "definition": "High Pressure High Temperature - wells exceeding defined pressure/temperature thresholds."},
      {"term": "Hydrostatic Pressure", "definition": "Pressure exerted by a column of fluid due to its height and density."},
      {"term": "ICP", "definition": "Initial Circulating Pressure - pump pressure at start of kill circulation."},
      {"term": "Influx", "definition": "Formation fluids entering the wellbore (gas, oil, or water)."},
      {"term": "IWCF", "definition": "International Well Control Forum - certification body for well control training."},
      {"term": "Kelly", "definition": "A square or hexagonal pipe that connects the rotary table to the drillstring."},
      {"term": "Kick", "definition": "Entry of formation fluids into the wellbore due to underbalanced conditions."},
      {"term": "Kick Tolerance", "definition": "Maximum kick volume that can be safely handled without fracturing the weakest formation."},
      {"term": "Kill Line", "definition": "High-pressure line used to pump kill fluid into the wellbore."},
      {"term": "Kill Mud", "definition": "Drilling fluid weighted to balance formation pressure."},
      {"term": "Kill Weight Mud", "definition": "Mud density required to balance formation pressure with no surface pressure."},
      {"term": "LOT", "definition": "Leak-Off Test - test to determine formation fracture pressure."},
      {"term": "LMRP", "definition": "Lower Marine Riser Package - upper portion of subsea BOP stack."},
      {"term": "Lost Circulation", "definition": "Loss of drilling fluid into the formation."},
      {"term": "MAASP", "definition": "Maximum Allowable Annular Surface Pressure - maximum pressure before formation breakdown."},
      {"term": "Migration", "definition": "Upward movement of gas in a shut-in well due to buoyancy."},
      {"term": "MPD", "definition": "Managed Pressure Drilling - drilling technique using surface back pressure for well control."},
      {"term": "Mud Weight", "definition": "Density of drilling fluid, typically expressed in ppg or sg."},
      {"term": "Overbalance", "definition": "Condition where wellbore pressure exceeds formation pressure."},
      {"term": "Pipe Light", "definition": "Condition where buoyancy effects make drillstring appear lighter than actual weight."},
      {"term": "Pipe Rams", "definition": "BOP rams designed to seal around specific pipe size."},
      {"term": "Pit Gain", "definition": "Increase in mud pit volume indicating influx."},
      {"term": "Pore Pressure", "definition": "Pressure of fluids within formation pore spaces."},
      {"term": "PWD", "definition": "Pressure While Drilling - downhole pressure measurement tool."},
      {"term": "RCD", "definition": "Rotating Control Device - pressure containment device allowing rotation."},
      {"term": "Riser", "definition": "Conduit connecting floating rig to subsea BOP or wellhead."},
      {"term": "ROV", "definition": "Remotely Operated Vehicle - underwater robot for subsea operations."},
      {"term": "SICP", "definition": "Shut-In Casing Pressure - pressure on annulus after shutting in on kick."},
      {"term": "SIDPP", "definition": "Shut-In Drillpipe Pressure - pressure on drillpipe after shutting in on kick."},
      {"term": "Slow Circulating Rate", "definition": "Reduced pump rate used for well control operations."},
      {"term": "Snubbing", "definition": "Running pipe into a well under pressure when pipe weight is less than wellbore pressure force."},
      {"term": "Soft Shut-In", "definition": "Closing BOP with choke initially open to limit water hammer."},
      {"term": "SPP", "definition": "Standpipe Pressure - pressure at the standpipe manifold."},
      {"term": "SSSV", "definition": "Subsurface Safety Valve - downhole valve providing well barrier in production wells."},
      {"term": "Stripping", "definition": "Running pipe into or out of a well under pressure when pipe weight exceeds pressure force."},
      {"term": "Swab", "definition": "Pressure reduction caused by pulling pipe upward."},
      {"term": "Surge", "definition": "Pressure increase caused by running pipe downward."},
      {"term": "Trip Margin", "definition": "Additional mud weight above required for overbalance, compensating for swab effects."},
      {"term": "TVD", "definition": "True Vertical Depth - vertical distance from reference point to target."},
      {"term": "Underbalance", "definition": "Condition where wellbore pressure is less than formation pressure."},
      {"term": "Volumetric Method", "definition": "Well control technique using periodic fluid bleed-off to control gas migration."},
      {"term": "Wait and Weight", "definition": "Well kill method using single circulation of kill weight mud."},
      {"term": "Water Hammer", "definition": "Pressure surge caused by sudden valve closure or pump stop."},
      {"term": "WBE", "definition": "Well Barrier Element - single component of a well barrier."},
      {"term": "Wellhead", "definition": "Equipment installed at surface providing structural support and pressure containment."},
      {"term": "WellSharp", "definition": "IADC well control certification program."}
    ]
  }
}
